DeleteResults
Syntax
SapObject.SapModel.DesignSteel.DeleteResults
VB6 Procedure
Function DeleteResults() As Long
Parameters
None
Remarks
This function deletes all steel frame design results.
The function returns zero if the results are successfully deleted; otherwise it returns a nonzero value.
VBA Example
Sub DeleteSteelDesignResults()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'run analysis
 ret = SapModel.File.Save("C:\SapAPI\x.sdb")
 ret = SapModel.Analyze.RunAnalysis
 'start steel design
 ret = SapModel.DesignSteel.StartDesign
 'delete steel design results
 ret = SapModel.DesignSteel.DeleteResults
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.03.
See Also